package main

import (
	"encoding/json"
	"fmt"
	"strconv"
	"strings"

	"github.com/xuri/excelize/v2"
)

func excelGen() {
	str := `[
    {
      "Key": "身份证",
      "Pattern": "(?:^|\\W|\\\\u0027)([1-9]{2}\\d(?:\\d{12}|\\*{12})\\d{2}[0-9Xx])(?:$|\\W)",
      "Desc": "中华人民共和国居民身份证",
      "Level": "信息安全规范:个人身份信息:3级;数据出境规范:个人敏感信息:监管;金融数据安全规范:个人基本概况:3级;电信数据安全标准:用户身份相关信息:3级;国家电网规范:个人证件信息:3级",
      "On": 1,
      "Score": 80
    },
    {
      "Key": "手机",
      "Pattern": "(?:^|\\W|\\\\u0027)(1[3-9][0-9](?:[0-9]{4}|\\*{4})\\d{4})(?:$|\\W)",
      "Desc": "号码为11位,其中各段有不同的编码方向:第1-3位—网络识别号;第4-7位—地区编码;第8-11位—用户号码",
      "Level": "信息安全规范:个人联系信息:3级;数据出境规范:个人敏感信息:监管;金融数据安全规范:个人联系信息:3级;电信数据安全标准:用户身份相关信息:3级;国家电网规范:重要个人联系及通信信息:3级",
      "On": 1,
      "Score": 80
    },
    {
      "Key": "邮箱",
      "Pattern": "[a-zA-Z0-9_\\-\\.]+(?:\\*{4})?@[a-zA-Z0-9_\\-\\.]+\\.[a-zA-Z]{2,5}",
      "Desc": "电子邮箱是自动接收网络任何电子邮箱所发的电子邮件,一般格式为用户名@域名",
      "Level": "信息安全规范:个人联系信息:2级;数据出境规范:个人敏感信息:监管;金融数据安全规范:个人联系信息:3级;电信数据安全标准:用户身份相关信息:3级;国家电网规范:重要个人联系及通信信息:3级",
      "On": 1,
      "Score": 50
    },
    {
      "Key": "银行卡",
      "Pattern": "(?:^|[^\\w\\.])((?:[13-689]\\d{11}|\\*{12})\\d{4,5}(?:\\d{3})?)(?:$|\\W)",
      "Desc": "由商业银行(含邮政金融机构) 向社会发行的具有消费信用、转账结算、存取现金等全部或部分功能的信用支付工具",
      "Level": "信息安全规范:个人金融信息:3级;数据出境规范:个人敏感信息:监管;金融数据安全规范:业务基本信息:2级;电信数据安全标准:用户身份相关信息:3级;国家电网规范:个人财产信息:3级",
      "On": 1,
      "Score": 50
    },
    {
      "Key": "固定电话",
      "Pattern": "(?:^|\\W)(0\\d{2,3}-\\d{7,8}|\\(0\\d{2,3}\\)-\\d{7,8}|\\(0\\d{2,3}\\)\\d{7,8})(?:$|\\W)",
      "Desc": "座机,固定在某个位置不移动的电话机",
      "Level": "信息安全规范:个人联系信息:2级;数据出境规范:个人一般信息:弱监管;金融数据安全规范:个人联系信息:3级;电信数据安全标准:用户身份相关信息:2级;国家电网规范:重要个人联系及通信信息:3级",
      "On": 1,
      "Score": 50
    },
    {
      "Key": "工号",
      "Pattern": "",
      "Desc": "工人证件号",
      "Level": "国家电网规范:个人可公开信息:1级",
      "On": 0
    },
    {
      "Key": "护照",
      "Pattern": "(?:^|\\W)(PE\\d{7}|DE\\d{7}|SE\\d{7}|E[A-HJ-NP-Z0-9]\\d{7})(?:$|\\W)",
      "Desc": "公民旅行通过各国国际口岸的一种通行证明",
      "Level": "信息安全规范:个人身份信息:3级;数据出境规范:个人敏感信息:监管;金融数据安全规范:个人基本概况:3级;电信数据安全标准:用户身份相关信息:2级;国家电网规范:个人证件信息:3级",
      "On": 1,
      "Score": 50
    },
    {
      "Key": "姓名",
      "Pattern": "(?:^|[^\\p{Han}])(\\p{Han})(\\p{Han}{1,2})(?:$|[^\\p{Han}：])",
      "Desc": "个人称呼",
      "Level": "信息安全规范:个人基本信息:2级;数据出境规范:个人敏感信息:监管;金融数据安全规范:个人基本概况:2级;电信数据安全标准:用户身份相关信息:2级;国家电网规范:个人可公开信息:1级",
      "On": 1,
      "Score": 50
    },
    {
      "Key": "军官证",
      "Pattern": "\\p{Han}字第[0-9a-zA-Z]{6,8}号",
      "Desc": "中国人民解放军军官证",
      "Level": "信息安全规范:个人身份信息:3级;数据出境规范:个人敏感信息:监管;金融数据安全规范:个人党政信息:2级;电信数据安全标准:用户身份相关信息:2级;国家电网规范:个人证件信息:3级",
      "On": 1,
      "Score": 50
    },
    {
      "Key": "地址",
      "Pattern": "\\p{Han}{2,3}省|\\p{Han}{2,4}市|\\p{Han}{4,8}自治州|\\p{Han}{2,7}区|\\p{Han}{1,10}县|[\\p{Han}0-9]+[街道乡镇路号楼室院单元]{1,2}",
      "Desc": "居住或通信的地点",
      "Level": "信息安全规范:个人基本信息:2级;数据出境规范:个人敏感信息:监管;金融数据安全规范:个人地理位置信息:3级;电信数据安全标准:用户身份相关信息:3级;国家电网规范:重要个人联系及通信信息:3级",
      "On": 1,
      "Score": 80
    },
    {
      "Key": "IPV4",
      "Pattern": "(?:(?:1[0-9][0-9]\\.)|(?:2[0-4][0-9]\\.)|(?:25[0-5]\\.)|(?:[1-9][0-9]\\.)|(?:[0-9]\\.)){3}(?:(?:1[0-9][0-9])|(?:2[0-4][0-9])|(?:25[0-5])|(?:[1-9][0-9])|(?:[0-9]))",
      "Desc": "互联网通信协议第四版",
      "Level": "信息安全规范:网络身份信息:2级;电信数据安全标准:承载网资源:2级;国家电网规范:个人网络安全信息:3级",
      "On": 0,
      "Score": 20
    },
    {
      "Key": "IPV6",
      "Pattern": "(?:[A-Fa-f0-9]{1,4}::?){1,7}[A-Fa-f0-9]{1,4}",
      "Desc": "互联网通信协议第六版",
      "Level": "信息安全规范:网络身份信息:2级;电信数据安全标准:承载网资源:2级;国家电网规范:个人网络安全信息:3级",
      "On": 0,
      "Score": 20
    },
    {
      "Key": "OAID",
      "Pattern": "(?:^|\\W)([a-fA-F0-9-]{32,64})(?:$|\\W)",
      "Desc": "设备唯一标识",
      "Level": "信息安全规范:网络身份信息:2级;金融数据安全规范:经验管理基本信息:2级;电信数据安全标准:终端设备信息:2级;国家电网规范:个人设备信息:3级",
      "On": 0,
      "Score": 20
    },
    {
      "Key": "IMEI",
      "Pattern": "(?:^|\\W)([\\d]{15}(?:\\d{2})?)(?:$|\\W)",
      "Desc": "国际移动设备识别码",
      "Level": "信息安全规范:网络身份信息:2级;金融数据安全规范:经验管理基本信息:2级;电信数据安全标准:终端设备信息:2级;国家电网规范:个人设备信息:3级",
      "On": 0,
      "Score": 20
    },
    {
      "Key": "车牌号",
      "Pattern": "([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-HJ-NP-Z][A-HJ-NP-Z0-9]{4,5}[A-HJ-NP-Z0-9挂学警港澳])|(WJ[京津冀晋蒙辽吉黑沪苏浙皖闽赣鲁豫鄂湘粤桂琼川贵云渝藏陕甘青宁新][0-9A-Z]{5})",
      "Desc": "车辆号牌",
      "Level": "信息安全规范:车辆基本信息:2级;金融数据安全规范:个人财产信息:3级;电信数据安全标准:用户身份相关信息:2级;国家电网规范:个人财产信息:3级",
      "On": 1,
      "Score": 50
    },
    {
      "Key": "统一社会信用代码",
      "Pattern": "(?:^|\\W)([0-9A-HJ-NPQRTUWXY]{2}\\d{6}[0-9A-HJ-NPQRTUWXY]{10})(?:$|\\W)",
      "Desc": "以公民身份号码和组织机构代码为基础的主体标识代码制度",
      "Level": "信息安全规范:企业工商信息:1级;数据出境规范:企业重要资产:监管;金融数据安全规范:单位基本概况:1级",
      "On": 1,
      "Score": 20
    },
    {
      "Key": "MAC",
      "Pattern": "(?:^|\\W)((?:[0-9a-fA-F]{2})(?:(?:[/\\s:][0-9a-fA-F]{2}){5})|(?:[0-9a-fA-F]{2})(?:(?:[/\\s-][0-9a-fA-F]{2}){5}))(?:$|\\W)",
      "Desc": "数据链路层网卡地址",
      "Level": "信息安全规范:网络身份信息:1级;金融数据安全规范:经验管理基本信息:2级;电信数据安全标准:终端设备信息:2级;国家电网规范:个人设备信息:3级",
      "On": 0,
      "Score": 20
    },
    {
      "Key": "车架号",
      "Pattern": "(?:^|\\W)([A-HJ-NPR-Z\\d]{8}[X\\d][A-HJ-NPR-Z\\d]{3}\\d{5})(?:$|\\W)",
      "Desc": "车辆识别代号",
      "Level": "信息安全规范:车辆基本信息:1级;金融数据安全规范:经验管理基本信息:2级",
      "On": 0,
      "Score": 20
    },
    {
      "Key": "账号",
      "Pattern": "(?:\"username\"|\"user\"|\"account\"):\\s*\\[?\"([^\"]+)\"",
      "Desc": "用户登录账号",
      "Level": "信息安全规范:个人身份鉴别信息:3级;数据出境规范:个人一般信息:弱监管;金融数据安全规范:个人传统鉴别信息:4级;电信数据安全标准:用户网络身份信息:4级;国家电网规范:个人网络安全信息:3级",
      "On": 1,
      "Score": 50
    },
    {
      "Key": "密码",
      "Pattern": "(?:\"password\"|\"pwd\"|\"old_password\"):\\s*\\[?\"([^\"]+)\"",
      "Desc": "用户登录密码",
      "Level": "信息安全规范:个人身份鉴别信息:4级;数据出境规范:个人一般信息:监管;金融数据安全规范:个人传统鉴别信息:4级;电信数据安全标准:用户网络身份信息:4级;国家电网规范:个人网络安全信息:3级",
      "On": 1,
      "Score": 80
    },
    {
      "Key": "云密钥",
      "Pattern": "",
      "Desc": "云服务器密钥",
      "Level": "信息安全规范:个人身份鉴别信息:3级;金融数据安全规范:个人传统鉴别信息:4级;电信数据安全标准:用户网络身份信息:4级;国家电网规范:个人网络安全信息:3级",
      "On": 0
    },
    {
      "Key": "微信公众号token",
      "Pattern": "",
      "Desc": "微信公众号token",
      "Level": "信息安全规范:个人身份鉴别信息:3级;金融数据安全规范:个人传统鉴别信息:4级",
      "On": 0
    },
    {
      "Key": "微信unionId",
      "Pattern": "",
      "Desc": "开发者拥有多个移动应用、网站应用、和公众帐号(包括小程序),可通过 UnionID 来区分用户的唯一性",
      "Level": "信息安全规范:个人身份鉴别信息:3级;电信数据安全标准:用户网络身份信息:3级",
      "On": 0
    },
    {
      "Key": "小程序openId",
      "Pattern": "",
      "Desc": "小程序openId,用户的唯一标识",
      "Level": "信息安全规范:个人身份鉴别信息:3级;电信数据安全标准:用户网络身份信息:3级",
      "On": 0
    },
    {
      "Key": "房产信息",
      "Pattern": "",
      "Desc": "不动产信息",
      "Level": "信息安全规范:个人财产信息:3级;金融数据安全规范:个人财产信息:3级;电信数据安全标准:用户身份相关信息:2级;国家电网规范:个人财产信息:3级",
      "On": 0
    },
    {
      "Key": "贷款金额",
      "Pattern": "",
      "Desc": "贷款金额",
      "Level": "信息安全规范:个人财产信息:3级;金融数据安全规范:个人信贷信息:3级",
      "On": 0
    },
    {
      "Key": "支付账号",
      "Pattern": "",
      "Desc": "交易用的支付账号",
      "Level": "信息安全规范:交易通用信息:3级;数据出境规范:个人一般信息:弱监管;金融数据安全规范:业务基本信息:2级",
      "On": 0
    },
    {
      "Key": "退款金额",
      "Pattern": "",
      "Desc": "退款金额",
      "Level": "信息安全规范:个人财产信息:3级;金融数据安全规范:业务交易金额信息:3级",
      "On": 0
    },
    {
      "Key": "征信信息",
      "Pattern": "",
      "Desc": "由特定机关建立的个人信用数据库所采集、整理、保存的,为有关信息服务所使用的个人信用信息",
      "Level": "信息安全规范:个人财产信息:3级;国家电网规范:个人财产信息:3级",
      "On": 0
    },
    {
      "Key": "信贷记录",
      "Pattern": "",
      "Desc": "信贷消费人不履行债务责任的记录",
      "Level": "信息安全规范:个人财产信息:3级;金融数据安全规范:个人信贷信息:3级;国家电网规范:个人财产信息:3级",
      "On": 0
    },
    {
      "Key": "证券账号",
      "Pattern": "",
      "Desc": "证券登记结算机构为投资者设立的,用于准确记载投资者所持的证券种类、名称、数量及相应权益和变动情况的账册",
      "Level": "信息安全规范:个人金融信息:3级;金融数据安全规范:业务基本信息:2级;电信数据安全标准:用户身份相关信息:2级",
      "On": 0
    },
    {
      "Key": "国籍",
      "Pattern": "(?:^|\\W)\"country\":\\s*\\[?\"(.*)\"(?:$|\\W)",
      "Desc": "个人属于某一个国家的国民或公民的法律资格",
      "Level": "信息安全规范:个人基本信息:2级;金融数据安全规范:个人基本概况:3级;电信数据安全标准:用户身份相关信息:2级;国家电网规范:个人基本信息:2级",
      "On": 0,
      "Score": 50
    },
    {
      "Key": "微信号",
      "Pattern": "",
      "Desc": "登录微信时使用的账号",
      "Level": "信息安全规范:个人联系信息:3级;金融数据安全规范:个人联系信息:3级;电信数据安全标准:用户网络身份信息:3级;国家电网规范:普通个人联系信息:3级",
      "On": 0
    },
    {
      "Key": "qq号",
      "Pattern": "",
      "Desc": "登录qq时使用的账号",
      "Level": "信息安全规范:个人联系信息:3级;金融数据安全规范:个人联系信息:3级;电信数据安全标准:用户网络身份信息:3级;国家电网规范:普通个人联系信息:3级",
      "On": 0
    },
    {
      "Key": "验证码",
      "Pattern": "",
      "Desc": "是一种区分用户是计算机还是人的公共全自动程序",
      "Level": "信息安全规范:个人身份鉴别信息:3级;金融数据安全规范:个人鉴别辅助信息:3级;电信数据安全标准:用户网络身份信息:3级;国家电网规范:个人网络安全信息:3级",
      "On": 0
    },
    {
      "Key": "鉴别信息(口令)",
      "Pattern": "",
      "Desc": "用于身份鉴别的密码",
      "Level": "信息安全规范:个人身份鉴别信息:3级;金融数据安全规范:个人鉴别辅助信息:3级;电信数据安全标准:用户网络身份信息:3级;国家电网规范:个人网络安全信息:3级",
      "On": 0
    },
    {
      "Key": "台湾居民大陆通行证",
      "Pattern": "",
      "Desc": "台湾地区居民往来大陆地区所持有的证件",
      "Level": "信息安全规范:个人身份信息:2级;数据出境规范:个人敏感信息:监管;金融数据安全规范:个人基本概况:3级;电信数据安全标准:用户身份相关信息:2级;国家电网规范:个人证件信息:3级",
      "On": 0
    },
    {
      "Key": "退休证",
      "Pattern": "",
      "Desc": "个人退休时取得的证书",
      "Level": "信息安全规范:个人身份信息:2级;数据出境规范:个人一般信息:弱监管;金融数据安全规范:个人基本概况:3级;电信数据安全标准:用户身份相关信息:2级;国家电网规范:个人证件信息:3级",
      "On": 0
    },
    {
      "Key": "居住证",
      "Pattern": "",
      "Desc": "居住证可享受当地居民的待遇",
      "Level": "信息安全规范:个人身份信息:2级;数据出境规范:个人敏感信息:监管;金融数据安全规范:个人基本概况:3级;电信数据安全标准:用户身份相关信息:2级;国家电网规范:个人证件信息:3级",
      "On": 0
    },
    {
      "Key": "社保卡",
      "Pattern": "",
      "Desc": "社会保障卡",
      "Level": "信息安全规范:个人身份信息:2级;数据出境规范:个人一般信息:弱监管;金融数据安全规范:个人基本概况:3级;电信数据安全标准:用户身份相关信息:2级;国家电网规范:个人证件信息:3级",
      "On": 0
    },
    {
      "Key": "澳门身份证",
      "Pattern": "",
      "Desc": "澳门特别行政区居民的身份证明文件",
      "Level": "信息安全规范:个人身份信息:2级;数据出境规范:个人敏感信息:监管;金融数据安全规范:个人基本概况:3级;电信数据安全标准:用户身份相关信息:2级;国家电网规范:个人证件信息:3级",
      "On": 0
    },
    {
      "Key": "港澳通行证",
      "Pattern": "",
      "Desc": "往来港澳通行证",
      "Level": "信息安全规范:个人身份信息:2级;数据出境规范:个人敏感信息:监管;金融数据安全规范:个人基本概况:3级;电信数据安全标准:用户身份相关信息:2级;国家电网规范:个人证件信息:3级",
      "On": 0
    },
    {
      "Key": "台湾身份证",
      "Pattern": "",
      "Desc": "台湾居民的身份证明文件",
      "Level": "信息安全规范:个人身份信息:2级;数据出境规范:个人敏感信息:监管;金融数据安全规范:个人基本概况:3级;电信数据安全标准:用户身份相关信息:2级;国家电网规范:个人证件信息:3级",
      "On": 0
    },
    {
      "Key": "香港永久性居民身份证",
      "Pattern": "",
      "Desc": "香港居民的主要身份证明文件",
      "Level": "信息安全规范:个人身份信息:2级;数据出境规范:个人敏感信息:监管;金融数据安全规范:个人基本概况:3级;电信数据安全标准:用户身份相关信息:2级",
      "On": 0
    },
    {
      "Key": "性别",
      "Pattern": "",
      "Desc": "生理性别",
      "Level": "信息安全规范:个人基本信息:2级;数据出境规范:个人一般信息:弱监管;金融数据安全规范:个人基本概况:3级;电信数据安全标准:用户身份相关信息:1级;国家电网规范:个人基本信息:2级",
      "On": 0
    },
    {
      "Key": "婚姻状态",
      "Pattern": "",
      "Desc": "个人婚姻状态",
      "Level": "信息安全规范:个人基本信息:2级;金融数据安全规范:个人基本概况:3级;国家电网规范:重要个人联系及通信信息:3级",
      "On": 0
    },
    {
      "Key": "出生证",
      "Pattern": "",
      "Desc": "个人出生证明",
      "Level": "信息安全规范:个人基本信息:2级;数据出境规范:个人一般信息:监管;金融数据安全规范:个人基本概况:3级;电信数据安全标准:用户身份相关信息:2级",
      "On": 0
    },
    {
      "Key": "中华民族",
      "Pattern": "",
      "Desc": "民族",
      "Level": "信息安全规范:个人基本信息:2级;金融数据安全规范:个人基本概况:3级;电信数据安全标准:用户身份相关信息:1级;国家电网规范:个人基本信息:3级",
      "On": 0
    },
    {
      "Key": "手机号(港澳台)",
      "Pattern": "",
      "Desc": "港澳台区移动设备号码",
      "Level": "信息安全规范:个人联系信息:2级;数据出境规范:个人敏感信息:监管;金融数据安全规范:个人联系信息:3级;电信数据安全标准:用户身份相关信息:3级",
      "On": 0
    },
    {
      "Key": "护照(脱敏)",
      "Pattern": "",
      "Desc": "通行证明加掩码处理",
      "Level": "信息安全规范:个人身份信息:2级;数据出境规范:个人敏感信息:弱监管;电信数据安全标准:用户身份相关信息:2级",
      "On": 0
    },
    {
      "Key": "固定电话(脱敏)",
      "Pattern": "",
      "Desc": "固话掩码处理",
      "Level": "信息安全规范:个人联系信息:2级;数据出境规范:个人一般信息:弱监管;电信数据安全标准:用户身份相关信息:2级",
      "On": 0
    },
    {
      "Key": "地址(脱敏)",
      "Pattern": "",
      "Desc": "地址信息加掩码处理",
      "Level": "信息安全规范:个人基本信息:2级;数据出境规范:个人一般信息:弱监管;电信数据安全标准:用户身份相关信息:2级",
      "On": 0
    },
    {
      "Key": "存折账号",
      "Pattern": "",
      "Desc": "银行存折号码",
      "Level": "信息安全规范:个人金融信息:2级;数据出境规范:个人一般信息:监管;金融数据安全规范:业务基本信息:2级",
      "On": 0
    },
    {
      "Key": "合同编号",
      "Pattern": "",
      "Desc": "合同编号",
      "Level": "信息安全规范:合同通用信息:2级;数据出境规范:企业重要资产:弱监管",
      "On": 0
    },
    {
      "Key": "交易流水号",
      "Pattern": "",
      "Desc": "交易流水号",
      "Level": "信息安全规范:交易通用信息:2级;数据出境规范:企业重要资产:弱监管;金融数据安全规范:业务交易基本信息:2级",
      "On": 0
    },
    {
      "Key": "交易订单号",
      "Pattern": "",
      "Desc": "交易订单号",
      "Level": "信息安全规范:交易通用信息:2级;数据出境规范:企业重要资产:弱监管;金融数据安全规范:单位财务信息:2级",
      "On": 0
    },
    {
      "Key": "交易金额",
      "Pattern": "",
      "Desc": "交易金额",
      "Level": "信息安全规范:交易通用信息:2级;金融数据安全规范:业务交易金额信息:2级",
      "On": 0
    },
    {
      "Key": "学生证号",
      "Pattern": "",
      "Desc": "学生证件号码",
      "Level": "信息安全规范:个人教育信息:2级;金融数据安全规范:个人就学信息:2级;电信数据安全标准:用户身份相关信息:2级",
      "On": 0
    },
    {
      "Key": "教育信息",
      "Pattern": "",
      "Desc": "教育记录信息",
      "Level": "信息安全规范:个人教育信息:2级;金融数据安全规范:个人就学信息:2级;电信数据安全标准:用户身份相关信息:2级",
      "On": 0
    },
    {
      "Key": "学历信息",
      "Pattern": "",
      "Desc": "接受科学文化教育经历",
      "Level": "信息安全规范:个人教育信息:2级;金融数据安全规范:个人就学信息:2级;电信数据安全标准:用户身份相关信息:2级;国家电网规范:个人教育信息:2级",
      "On": 0
    },
    {
      "Key": "学位信息",
      "Pattern": "",
      "Desc": "接受科学文化教育取得的学位信息",
      "Level": "信息安全规范:个人教育信息:2级;金融数据安全规范:个人就学信息:2级;电信数据安全标准:用户身份相关信息:2级;国家电网规范:个人教育信息:2级",
      "On": 0
    },
    {
      "Key": "职业信息",
      "Pattern": "",
      "Desc": "职业信息",
      "Level": "信息安全规范:个人工作信息:2级;金融数据安全规范:个人职业信息:2级;电信数据安全标准:用户身份相关信息:2级;国家电网规范:个人工作信息:3级",
      "On": 0
    },
    {
      "Key": "职位信息",
      "Pattern": "",
      "Desc": "职位信息",
      "Level": "信息安全规范:个人工作信息:2级;金融数据安全规范:个人职业信息:2级;电信数据安全标准:用户身份相关信息:1级;国家电网规范:个人工作信息:3级",
      "On": 0
    },
    {
      "Key": "工作经历",
      "Pattern": "",
      "Desc": "工作经历",
      "Level": "信息安全规范:个人工作信息:2级;金融数据安全规范:个人职业信息:2级;电信数据安全标准:用户身份相关信息:1级;国家电网规范:个人工作信息:3级",
      "On": 0
    },
    {
      "Key": "增值税号",
      "Pattern": "",
      "Desc": "增值税号",
      "Level": "信息安全规范:企业工商信息:2级;金融数据安全规范:企业税务信息:2级",
      "On": 0
    },
    {
      "Key": "公司",
      "Pattern": "(?:^|\\W)(\\p{Han}+公司)(?:$|\\W)",
      "Desc": "以营利为目的社团法人",
      "Level": "信息安全规范:企业工商信息:2级;数据出境规范:企业重要资产:弱监管;金融数据安全规范:单位基本概况:1级",
      "On": 1,
      "Score": 50
    },
    {
      "Key": "纳税人识别号",
      "Pattern": "",
      "Desc": "纳税人、扣缴义务人的纳税识别代码",
      "Level": "信息安全规范:企业工商信息:1级;数据出境规范:企业重要资产:弱监管;金融数据安全规范:单位基本概况:1级",
      "On": 0
    },
    {
      "Key": "营业执照",
      "Pattern": "",
      "Desc": "工商行政管理机关发给工商企业、个体经营者的准许从事某项生产经营活动的凭证",
      "Level": "信息安全规范:企业工商信息:1级;数据出境规范:企业重要资产:监管;金融数据安全规范:单位基本概况:1级",
      "On": 0
    },
    {
      "Key": "组织机构代码",
      "Pattern": "",
      "Desc": "对中华人民共和国内依法注册、依法登记的机关、企事业单位、社会团体，以及其他组织机构颁发一个在全国范围内唯一的、始终不变的代码标识",
      "Level": "信息安全规范:企业工商信息:2级;数据出境规范:企业重要资产:监管;金融数据安全规范:单位基本概况:1级",
      "On": 0
    },
    {
      "Key": "驾驶证",
      "Pattern": "",
      "Desc": "依照法律机动车辆驾驶人员所需申领的证照",
      "Level": "信息安全规范:个人身份信息:2级;金融数据安全规范:个人基本概况:3级;电信数据安全标准:用户身份相关信息:2级",
      "On": 0
    },
    {
      "Key": "医嘱单",
      "Pattern": "",
      "Desc": "医生拟订治疗计划的记录",
      "Level": "信息安全规范:个人健康信息:2级;金融数据安全规范:个人健康生理信息:4级",
      "On": 0
    },
    {
      "Key": "病症",
      "Pattern": "",
      "Desc": "患病后的症状",
      "Level": "信息安全规范:个人健康信息:2级;金融数据安全规范:个人健康生理信息:4级",
      "On": 0
    },
    {
      "Key": "手术记录",
      "Pattern": "",
      "Desc": "医生反映手术一般情况、手术经过的记录",
      "Level": "信息安全规范:个人健康信息:2级;金融数据安全规范:个人健康生理信息:4级",
      "On": 0
    },
    {
      "Key": "用药记录",
      "Pattern": "",
      "Desc": "病着的用药记录",
      "Level": "信息安全规范:个人健康信息:2级;金融数据安全规范:个人健康生理信息:4级",
      "On": 0
    },
    {
      "Key": "药物过敏",
      "Pattern": "",
      "Desc": "药物引起异常免疫反应",
      "Level": "信息安全规范:个人健康信息:2级;金融数据安全规范:个人健康生理信息:4级",
      "On": 0
    },
    {
      "Key": "以往病史",
      "Pattern": "",
      "Desc": "过往的病史记录",
      "Level": "信息安全规范:个人健康信息:2级;金融数据安全规范:个人健康生理信息:4级",
      "On": 0
    },
    {
      "Key": "工作证",
      "Pattern": "",
      "Desc": "用人单位工作的证件",
      "Level": "信息安全规范:个人身份信息:2级;金融数据安全规范:个人职业信息:2级;电信数据安全标准:用户身份相关信息:2级;国家电网规范:个人证件信息:3级",
      "On": 0
    },
    {
      "Key": "宗教信仰",
      "Pattern": "",
      "Desc": "特殊的社会意识形态和文化现象",
      "Level": "信息安全规范:个人其他信息:2级",
      "On": 0
    },
    {
      "Key": "婚史",
      "Pattern": "",
      "Desc": "结过婚的经历",
      "Level": "信息安全规范:个人其他信息:2级;金融数据安全规范:个人基本概况:3级;国家电网规范:重要个人联系及通信信息:3级",
      "On": 0
    },
    {
      "Key": "序列号",
      "Pattern": "",
      "Desc": "电子产品的全球唯一标识码",
      "Level": "信息安全规范:个人设备信息:2级;金融数据安全规范:经验管理基本信息:2级;电信数据安全标准:终端设备信息:2级;国家电网规范:个人设备信息:3级",
      "On": 0
    },
    {
      "Key": "IMSI",
      "Pattern": "",
      "Desc": "国际移动用户识别码",
      "Level": "信息安全规范:个人设备信息:2级;金融数据安全规范:经验管理基本信息:2级;电信数据安全标准:终端设备信息:2级;国家电网规范:个人设备信息:3级",
      "On": 0
    },
    {
      "Key": "ICCID",
      "Pattern": "",
      "Desc": "集成电路卡识别码即SIM卡卡号",
      "Level": "信息安全规范:个人设备信息:2级;金融数据安全规范:经验管理基本信息:2级;电信数据安全标准:终端设备信息:2级;国家电网规范:个人设备信息:3级",
      "On": 0
    },
    {
      "Key": "AndroidID",
      "Pattern": "",
      "Desc": "Android设备的唯一标识",
      "Level": "信息安全规范:个人设备信息:2级;金融数据安全规范:经验管理基本信息:2级;电信数据安全标准:终端设备信息:2级;国家电网规范:个人设备信息:3级",
      "On": 0
    },
    {
      "Key": "IDFA",
      "Pattern": "",
      "Desc": "唯一设备ID",
      "Level": "信息安全规范:个人设备信息:2级;金融数据安全规范:经验管理基本信息:2级;电信数据安全标准:终端设备信息:2级;国家电网规范:个人设备信息:3级",
      "On": 0
    },
    {
      "Key": "运营商信息",
      "Pattern": "",
      "Desc": "网络服务的供应商",
      "Level": "信息安全规范:个人设备信息:2级;数据出境规范:企业重要资产:弱监管",
      "On": 0
    },
    {
      "Key": "行踪轨迹",
      "Pattern": "",
      "Desc": "个人行程的记录信息",
      "Level": "信息安全规范:个人位置信息:2级;金融数据安全规范:个人地理位置信息:3级;国家电网规范:个人位置信息:3级",
      "On": 0
    },
    {
      "Key": "定位信息",
      "Pattern": "",
      "Desc": "定位信息",
      "Level": "信息安全规范:个人位置信息:2级;金融数据安全规范:个人地理位置信息:3级;国家电网规范:个人位置信息:3级",
      "On": 0
    },
    {
      "Key": "酒店住宿信息",
      "Pattern": "",
      "Desc": "酒店住宿记录信息",
      "Level": "信息安全规范:个人位置信息:2级;金融数据安全规范:个人地理位置信息:3级;国家电网规范:个人位置信息:3级",
      "On": 0
    },
    {
      "Key": "经纬度",
      "Pattern": "",
      "Desc": "经度与纬度组成的坐标系统",
      "Level": "信息安全规范:个人位置信息:2级;国家电网规范:个人位置信息:3级",
      "On": 0
    },
    {
      "Key": "出入证",
      "Pattern": "",
      "Desc": "出入的凭证",
      "Level": "信息安全规范:个人身份信息:2级;国家电网规范:个人证件信息:3级",
      "On": 0
    },
    {
      "Key": "资产信息",
      "Pattern": "",
      "Desc": "个人资产的记录",
      "Level": "信息安全规范:个人财产信息:2级;金融数据安全规范:个人财产信息:3级;国家电网规范:个人财产信息:3级",
      "On": 0
    },
    {
      "Key": "薪资流水",
      "Pattern": "",
      "Desc": "薪资记录",
      "Level": "信息安全规范:个人财产信息:2级;金融数据安全规范:个人财产信息:3级;国家电网规范:个人财产信息:3级",
      "On": 0
    },
    {
      "Key": "发票登记信息",
      "Pattern": "",
      "Desc": "发票登记信息",
      "Level": "信息安全规范:个人金融信息:2级",
      "On": 0
    },
    {
      "Key": "住院记录",
      "Pattern": "",
      "Desc": "过往的住院记录",
      "Level": "信息安全规范:个人医疗信息:2级;金融数据安全规范:个人健康生理信息:4级;国家电网规范:个人健康生理信息:3级",
      "On": 0
    },
    {
      "Key": "生育信息",
      "Pattern": "",
      "Desc": "过往的住生育信息院记录",
      "Level": "信息安全规范:个人生理信息:2级;国家电网规范:个人健康生理信息:3级",
      "On": 0
    },
    {
      "Key": "药品购买记录",
      "Pattern": "",
      "Desc": "过往的药品购买记录",
      "Level": "信息安全规范:个人医疗信息:2级;金融数据安全规范:个人健康生理信息:4级",
      "On": 0
    },
    {
      "Key": "药品数量",
      "Pattern": "",
      "Desc": "购买的药品数量",
      "Level": "信息安全规范:个人医疗信息:2级",
      "On": 0
    },
    {
      "Key": "药品名称",
      "Pattern": "",
      "Desc": "药品名称",
      "Level": "信息安全规范:个人医疗信息:2级;数据出境规范:个人一般信息:弱监管",
      "On": 0
    },
    {
      "Key": "体重",
      "Pattern": "",
      "Desc": "个人体重",
      "Level": "信息安全规范:个人生理信息:2级;国家电网规范:个人健康生理信息:3级",
      "On": 0
    },
    {
      "Key": "身高",
      "Pattern": "",
      "Desc": "个人身高",
      "Level": "信息安全规范:个人生理信息:2级;电信数据安全标准:用户身份相关信息:1级;国家电网规范:个人健康生理信息:3级",
      "On": 0
    },
    {
      "Key": "个人数字证书",
      "Pattern": "",
      "Desc": "权威机构颁发的虚拟世界身份",
      "Level": "信息安全规范:网络身份信息:2级",
      "On": 0
    },
    {
      "Key": "发电装机容量",
      "Pattern": "",
      "Desc": "发电装机容量",
      "Level": "国家电网规范:公共发电数据:2级",
      "On": 0
    },
    {
      "Key": "当日全省最大供电能力",
      "Pattern": "",
      "Desc": "当日全省最大供电能力",
      "Level": "国家电网规范:公共发电数据:4级",
      "On": 0
    },
    {
      "Key": "全省统调发电量",
      "Pattern": "",
      "Desc": "全省统调发电量",
      "Level": "国家电网规范:公共发电数据:3级",
      "On": 0
    },
    {
      "Key": "电厂机组运行情况",
      "Pattern": "",
      "Desc": "电厂机组运行情况",
      "Level": "国家电网规范:公共发电数据:3级",
      "On": 0
    },
    {
      "Key": "购电统计信息",
      "Pattern": "",
      "Desc": "购电统计信息",
      "Level": "国家电网规范:公共发电数据:4级",
      "On": 0
    },
    {
      "Key": "电力交易市场主体电力交易信用信息",
      "Pattern": "",
      "Desc": "电力交易市场主体电力交易信用信息",
      "Level": "国家电网规范:公共交易数据:1级",
      "On": 0
    },
    {
      "Key": "售电公司信息",
      "Pattern": "",
      "Desc": "售电公司信息",
      "Level": "国家电网规范:公共交易数据:1级",
      "On": 0
    },
    {
      "Key": "年度交易成交情况",
      "Pattern": "",
      "Desc": "年度交易成交情况",
      "Level": "国家电网规范:公共交易数据:3级",
      "On": 0
    },
    {
      "Key": "输配电价",
      "Pattern": "",
      "Desc": "输配电价",
      "Level": "国家电网规范:公共输电数据:1级",
      "On": 0
    },
    {
      "Key": "电网运行情况",
      "Pattern": "",
      "Desc": "电网运行情况",
      "Level": "国家电网规范:公共输电数据:4级",
      "On": 0
    },
    {
      "Key": "实时运行信息",
      "Pattern": "",
      "Desc": "实时运行信息",
      "Level": "国家电网规范:公共输电数据:4级",
      "On": 0
    },
    {
      "Key": "供电两率信息",
      "Pattern": "",
      "Desc": "供电两率信息",
      "Level": "国家电网规范:公共配电数据:1级",
      "On": 0
    },
    {
      "Key": "配电设备检修计划",
      "Pattern": "",
      "Desc": "配电设备检修计划",
      "Level": "国家电网规范:公共配电数据:2级",
      "On": 0
    },
    {
      "Key": "电网销售电价表",
      "Pattern": "",
      "Desc": "电网销售电价表",
      "Level": "国家电网规范:公共用电数据:1级",
      "On": 0
    },
    {
      "Key": "全社会用电量",
      "Pattern": "",
      "Desc": "全社会用电量",
      "Level": "国家电网规范:公共用电数据:1级",
      "On": 0
    },
    {
      "Key": "停电信息",
      "Pattern": "",
      "Desc": "停电信息",
      "Level": "国家电网规范:公共用电数据:1级",
      "On": 0
    },
    {
      "Key": "重点产业/行业用电信息",
      "Pattern": "",
      "Desc": "重点产业/行业用电信息",
      "Level": "国家电网规范:公共用电数据:2级",
      "On": 0
    },
    {
      "Key": "区域最高用电负荷",
      "Pattern": "",
      "Desc": "区域最高用电负荷",
      "Level": "国家电网规范:公共用电数据:3级",
      "On": 0
    },
    {
      "Key": "清洁能源占比信息",
      "Pattern": "",
      "Desc": "清洁能源占比信息",
      "Level": "国家电网规范:综合能源服务数据:1级",
      "On": 0
    },
    {
      "Key": "重点企业用能信息",
      "Pattern": "",
      "Desc": "重点企业用能信息",
      "Level": "国家电网规范:综合能源服务数据:3级",
      "On": 0
    },
    {
      "Key": "发电机组",
      "Pattern": "",
      "Desc": "发电机产生能量、存储器中回收能量信息等",
      "Level": "国家电网规范:发电设备:4级",
      "On": 0
    },
    {
      "Key": "光伏设备",
      "Pattern": "",
      "Desc": "光伏组件、光伏项目信息、光伏并网申请等",
      "Level": "国家电网规范:发电设备:3级",
      "On": 0
    },
    {
      "Key": "储能设备",
      "Pattern": "",
      "Desc": "储能类型、储能设备方案、运行储能设备等",
      "Level": "国家电网规范:发电设备:3级",
      "On": 0
    },
    {
      "Key": "载流导体",
      "Pattern": "",
      "Desc": "载流导体名称、类型、运行、维修等信息",
      "Level": "国家电网规范:输电设备:3级",
      "On": 0
    },
    {
      "Key": "防御过电压设备",
      "Pattern": "",
      "Desc": "防御过电压设备名称、类型、运行、维修等信息",
      "Level": "国家电网规范:输电设备:4级",
      "On": 0
    },
    {
      "Key": "绝缘子",
      "Pattern": "",
      "Desc": "绝缘子名称、类型、运行、维修等信息",
      "Level": "国家电网规范:输电设备:3级",
      "On": 0
    },
    {
      "Key": "接地设备",
      "Pattern": "",
      "Desc": "接地设备名称、类型、运行、维修等信息",
      "Level": "国家电网规范:输电设备:2级",
      "On": 0
    },
    {
      "Key": "自动化设备",
      "Pattern": "",
      "Desc": "自动化设备名称、类型、运行、维修等信息",
      "Level": "国家电网规范:输电设备:3级",
      "On": 0
    },
    {
      "Key": "变电变压器",
      "Pattern": "",
      "Desc": "变电变压器名称、类型、运行、维修等信息",
      "Level": "国家电网规范:变电设备:4级",
      "On": 0
    },
    {
      "Key": "开关电器",
      "Pattern": "",
      "Desc": "开关电器名称、类型、运行、维修等信息",
      "Level": "国家电网规范:变电设备:3级",
      "On": 0
    },
    {
      "Key": "限流电器",
      "Pattern": "",
      "Desc": "限流电器名称、类型、运行、维修等信息",
      "Level": "国家电网规范:变电设备:3级",
      "On": 0
    },
    {
      "Key": "补偿设备",
      "Pattern": "",
      "Desc": "补偿设备名称、类型、运行、维修等信息",
      "Level": "国家电网规范:变电设备:3级",
      "On": 0
    },
    {
      "Key": "仪用互感器",
      "Pattern": "",
      "Desc": "仪用互感器名称、类型、运行、维修等信息",
      "Level": "国家电网规范:变电设备:3级",
      "On": 0
    },
    {
      "Key": "御过电压设备",
      "Pattern": "",
      "Desc": "御过电压设备名称、类型、运行、维修等信息",
      "Level": "国家电网规范:变电设备:3级",
      "On": 0
    },
    {
      "Key": "保护装置",
      "Pattern": "",
      "Desc": "保护装置名称、类型、运行、维修等信息",
      "Level": "国家电网规范:变电设备:3级",
      "On": 0
    },
    {
      "Key": "直流电源",
      "Pattern": "",
      "Desc": "直流电源名称、类型、运行、维修等信息",
      "Level": "国家电网规范:变电设备:2级",
      "On": 0
    },
    {
      "Key": "配电变压器",
      "Pattern": "",
      "Desc": "配电变压器名称、类型、运行、维修等信息",
      "Level": "国家电网规范:配电设备:4级",
      "On": 0
    },
    {
      "Key": "电表",
      "Pattern": "",
      "Desc": "电表名称、类型、运行、维修等信息",
      "Level": "国家电网规范:用电设备:4级",
      "On": 0
    },
    {
      "Key": "用户电器",
      "Pattern": "",
      "Desc": "用户电器名称、类型、运行、维修等信息",
      "Level": "国家电网规范:用电设备:3级",
      "On": 0
    },
    {
      "Key": "充电桩",
      "Pattern": "",
      "Desc": "充电桩名称、类型、运行、维修等信息",
      "Level": "国家电网规范:用电设备:2级",
      "On": 0
    },
    {
      "Key": "客户清项",
      "Pattern": "",
      "Desc": "客户信息、清项明细等",
      "Level": "国家电网规范:应收管理:3级",
      "On": 0
    },
    {
      "Key": "电费应收",
      "Pattern": "",
      "Desc": "电费应收报表及汇总数据",
      "Level": "国家电网规范:应收管理:3级",
      "On": 0
    },
    {
      "Key": "发票信息",
      "Pattern": "",
      "Desc": "客户信息、发票金额、开票日期等",
      "Level": "国家电网规范:应收管理:3级",
      "On": 0
    },
    {
      "Key": "应收账款",
      "Pattern": "",
      "Desc": "应收账款报表及汇总数据",
      "Level": "国家电网规范:应付管理:3级",
      "On": 0
    },
    {
      "Key": "费用报销",
      "Pattern": "",
      "Desc": "费用报销报表及汇总数据",
      "Level": "国家电网规范:应付管理:3级",
      "On": 0
    },
    {
      "Key": "供应商清项",
      "Pattern": "",
      "Desc": "供应商名称、清项明细等",
      "Level": "国家电网规范:应付管理:3级",
      "On": 0
    },
    {
      "Key": "成本核算",
      "Pattern": "",
      "Desc": "成本报表及汇总数据",
      "Level": "国家电网规范:成本管理:3级",
      "On": 0
    },
    {
      "Key": "成本分析",
      "Pattern": "",
      "Desc": "成本分析报表及汇总数据",
      "Level": "国家电网规范:成本管理:3级",
      "On": 0
    }
  ]`
	type S struct {
		Key   string `json:"key"`
		Desc  string `json:"desc"`
		Level string `json:"level"`
		On    int    `json:"on"`
	}

	var res []S
	if err := json.Unmarshal([]byte(str), &res); err != nil {
		fmt.Println(err)
	}
	values := make([][]interface{}, 0)
	for _, r := range res {
		if strings.Contains(r.Level, "国家电网规范") {
			value := make([]interface{}, 0)
			ll := strings.Split(r.Level, ";")
			level := ll[len(ll)-1]
			levels := strings.Split(level, ":")
			value = append(value, []interface{}{r.Key, r.Desc, levels[0], levels[1], levels[2], r.On}...)
			values = append(values, value)
		}
	}
	excel := excelize.NewFile()
	excels := make([]string, 6)
	defer excel.Close()
	for i, vv := range values {
		for j, cell := range []string{"A", "B", "C", "D", "E", "F"} {
			excels[j] = cell + strconv.Itoa(i+1)
		}
		for k, cell := range excels {
			if err := excel.SetCellValue("Sheet1", cell, vv[k]); err != nil {
				fmt.Println(err)
			}
		}
	}
	if err := excel.SaveAs("国家电网规范.xlsx"); err != nil {
		fmt.Println("2 ", err)
	}
}
